# SortCurveLoops Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..SortCurveLoops Method
ExporterIFCUtils Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<IList<CurveLoop>> SortCurveLoops(
	IList<CurveLoop> loops
)
```

Visual Basic
---
```text
Public Shared Function SortCurveLoops ( _
	loops As IList(Of CurveLoop) _
) As IList(Of IList(Of CurveLoop))
```

Visual C++
---
```text
public:
static IList<IList<CurveLoop^>^>^ SortCurveLoops(
	IList<CurveLoop^>^ loops
)
```

# ### Parameters
loops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)>
# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace